01  TRACK.
    03 REC-ID                PIC XX.
    03 TRACK-DATA.
       05 TPOS               PIC XX.
       05 TNAME              PIC X(40).
       05 SECONDS            PIC 99999.
